# -*- coding: utf-8 -*-

#   Глобальный справочники
MENU_OO = [
	{'name': u'Принять вызов',	'type': [1, 2, 4, 8, 16],	'view': 'NEW_CALL',	},
	{'name': u'Вызова в работе',	'type': [1, 2, 4, 8, 16],	'view': 'CLL_OPER',	},
	{'name': u'Архив вызовов',	'type': [1, 2, 4, 16],	'view': 'CLL_ARCH', 'opts': {}},
	{'name': u'Бригады',	'type': [1, 2, 4, 8, 16],	'opts': {}},
	{'name': u'Машины',	'type': [1, 2, 4, 8, 16],	'opts': {}},
	{'name': u'Справка',	'type': [1, 2, 4],	'opts': {}},
	{'name': u'Статистика',	'type': [1, 2, 4],	'opts': {}},
]
